
public class sample4 {

	public static void main(String[] args) {
		// 불 (boolean)
		// 참 또는 거짓의 값을 갖는 자료형을 불 자료형이라고 한다. 자료형의 명칭은 boolean(불린 또는 불리언이라고 부른다)이다. 불 자료형에 대입되는 값은 참(true) 또는 거짓(false)만 가능하다.
		// 다음은 불 변수에 값을 대입한 예제이다.
		boolean isSuccess = ture;
		boolean istTest = false;
		
		// 불 연산
		// 불 자료형에는 불 연산의 결과값이 대입될 수 있다. 불 연산은 참, 거짓을 판한다는 연산을 말한다.
		// 예를 들어 다음과 같은 불 연산들이 있다.
		// 2 > 1 참
		// 1 == 2 거짓
		// 3 % 2 == 1 참 (3을 2로 나눈 나머지는 1이므로 참이다.)
		// "3".equlas("2") 거짓
		// 이러한 부울 연산의 결과는 참 또는 거짓이므로 if문과 같은 조건문에 쓰이거나 불 자료형에 대입될 수 있다.
		

	}

}
